[
      {
            "date": "2022-05-01T11:53:00Z",
            "title": "Glenn Cagandahan: Master of everyday Pinoy steampunk art",
            "full_article": "\n\nGlenn Cagandahan in his studio —EDGAR ALLAN M. SEMBRANO\nArt critic Cid Reyes once described Glenn Cagandahan’s works as done with “fantastical visions,” with diverse themes from Philippine personages and legends to contemporary culture, which are often executed into steampunk assemblages, in that style that combines history and technology inspired by science fiction.\n“From out of an assembly line of mechanical parts, dazzling in their fractal repetition at once an abstraction and representation of Man as Machine, or The Machine as Monster that gnaws at man’s soul, Glenn Cagandahan proffers his newfound vision of art—species in itself of theatrical choreography in the way the molded figures, with their smooth, mask-like faces, attach space with their dramatic stances,” said Reyes.\n“Bull of Courage”\nCagandahan, a Paete, Laguna, native, is a product of the University of the Philippines (UP) College of Fine Arts who first tried his hand at sculptural works through the restoration of public sculptures inside UP, which were assigned to him and his fellow students then by their professor Ginny Dandan.\nThis exposure, he said, led him to discover a method of restoring damaged wooden sculptures by combining Epoxy clay and sawdust, the same materials he used when he ventured into the world of visual art close to 20 years ago.\nEveryday life\n“Future Perfect” book cover\nSince then, Cagandahan’s works expanded from wooden sculptures to mixed media and assemblages. He likes to execute works related to the Filipinos’ everyday life, family scenes and relationships.\nHis oeuvre also includes those with religious themes mainly because of his Christian faith, being a son of a Christian pastor and a pastor himself.\n\n\n\n\nHis art is definitely Filipino, and most people can identify and relate to his award-winning works.\n“It’s Filipino simply because my art is rooted in my experience and interaction with my surroundings, people, cultures and beliefs,” he said, adding he is always inspired in his craft by God, country and family.\n“My art is my life and everything about my art is about me and everything that has happened in the past and current situation,” he said.\n“Namimingwit”\nLike breathing\n“I am a probinsiyano (from the province), so this reflects in my works, plus I am also a musician and a pastor. That’s why my sculptures depict music and spirituality,” he explained.\nHe lists master carver Luis Ac-ac and the famed Michael Cacnio as his local influences, while the French Auguste Rodin, considered as the father of modern sculpture, and the great Michelangelo are the international artists who influenced him and his works.\n“Sukob” —PHOTOS COURTESY OF FSI\nFor Cagandahan, it is important to “live your life in pursuing your passion, since it is the only way you will live. Art is like breathing because if you don’t breathe, you die,” he said, saying it is the “same thing with art, since if you don’t do art as an artist, that’s the end of it!”\nFor his works, he said he does not want to be boxed in, as he does not stop exploring other themes and skills for his chosen field of endeavor. “I want to continuously evolve in subjects and techniques as I traverse in my career,” he said.\nThat career of close to two decades has earned a number of awards for Cagandahan. He placed second for his work “Paul and Silas” during the 2006 edition of the Art Association of the Philippines Annual Art Competition, the same event where his other work “Pagdagit” was cited with an honorable mention in 2004. He was also given honorable mention awards in the same contest in 2005 and 2007 for his works “Gomburza” and “Poseidon,” respectively.\n‘Future Perfect’\n“Fishball Vendor”\nThe Foreign Service Institute (FSI) of the Department of Foreign Affairs (DFA) published a book on him titled “Future Perfect.”\nThe book, authored by Reyes, journalist and educator Evelyn Katigbak, FSI head ambassador Jose Maria Cariño, and foreign affairs research specialist Luzviminda Naval, is “a celebration of the genius and resolve of young Filipino artists, perfectly represented by mixed media sculptor Glenn Cagandahan.”\nIt is part of FSI’s pivot to Philippine arts, culture and heritage promotion which started last year as part of the DFA’s push for public and cultural diplomacy.\nIn the book, Foreign Secretary Teodoro Locsin Jr. said, “Showcasing artistic talent and heritage should be a main part of diplomacy” as “sometimes, it is easier to foster understanding in the vivid silence of a painting or a compressed action of a sculpture than with words and phrases, and in touching the deep places all humans have in common, art compresses experience; discloses divides; renders differences trivial.” —CONTRIBUTED\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-05-01T11:53:00Z",
            "title": "DLSU writers’ workshop for doctors open for applications",
            "full_article": "\n\nDe La Salle University Manila\nThe Third La Salle National CNF Writers’ Workshop for Doctors of Bienvenido N. Santos Creative Writing Center (BNSCWC) is open for applications from physician-writers. The workshop will be held on Thursday and Friday evenings (6 p.m. to 9 p.m.) from July 7 to July 22 via Zoom.\nThe workshop is part of BNSCWC’s efforts to boost collaborations and critical/creative exchanges between scientists and artists; to train medical practitioners (who have the potential to write or who already have manuscripts) in the art of life writing; and to help immortalize the stories and contributions of our front-liners to this nation, especially during these precarious times.\nMarjorie M. Evasco, De La Salle University’s (DLSU) writer in residence and professor emeritus of literature, is the project director. She will be joined by doctor-writers Dr. Lance Isidore Catedral and Dr. Joey A. Tabula in the panel. The workshop shall consist of six synchronous sessions on Thursday and Friday evenings across three weeks. Fellows will be given craft lectures by physician-writers, and will be offered writing prompts for possible writing projects that may be taken up on the last session.\nApplicants are asked to submit at least one nonfiction narrative or personal essay ranging from 2,500 to 3,500 words in either English or Filipino. Ten fellows shall be chosen for this workshop.\nApplication requirements are: a PDF of a short resume, with a page containing applicant’s ID photo and complete contact information (residence address, email address, contact number); DOCx file of the creative nonfiction piece following this file format: surname and first keyword of the work.\nApplications must be submitted by May 15 via Google Forms: tinyurl.com/BNSCNF-WorkshopforDoctors. Chosen fellows will be informed on June 5 and must confirm their participation by June 15.\n\n\n\n\nEmail [email protected]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-05-01T09:17:44Z",
            "title": "Janelle Tee embraces sexy to become a good actress",
            "full_article": "\n\nMiss Philippines Earth 2019 Janelle Tee is getting out of the box as she plays a sexy role in her latest movie, something she feels that she has to go through, just like any other aspiring actress.\nTee plays Euka in “Putahe” who sheds her mysterious aura and reveals her wild, seductive side as she engages in a tryst with Ayanna Misola’s Jenny character.\nHer transition from a former beauty queen to a sexy star is not without challenges.\n“I would say [it is] challenging [because] from being wholesome and then of course you’re doing sexy films,” she noted during the online press conference for the movie last Wednesday, April 25. “Kumbaga, mahirap siya. Gusto ko kasing maging isang magaling na aktres. Kumbaga, pinasok ko ito, ano ba ang proseso para doon.”\n(It is hard. I want to be a good actress. It is like, I went into this, so what is the process to become [a good actress]?)\nTee felt she needed to get out of the box to make her dream come true.\n\n\n\n\n“Kailangan kong baliin ‘yung pagiging beauty queen na nakakahon lang ako sa roles na kailangan maganda, kailangan best friend ka ni ganito. I would forever get those roles if hindi ko babaliin ‘yung ganoon and hindi ko ipapakita na kaya kong maging isang magaling na aktres,” she said.\n(I need to break [my image] of being a beauty queen where I am just boxed in roles where I need to be beautiful, to be just the best friend [of another character]. I would forever get those roles if I don’t break [that image] and show that I can be a good actress.)\nImage: Instagram/@_janelletee\n“If being sexy would be the starting process towards that, then I am embracing it fully now,” she added.\nAs Euka, a bisexual in the movie, Tee discovered the world of a woman engaged in a girl-to-girl relationship.\n“Wala sa gender ang pagmamahal. Kapag nagmahal ka ay ibinubuhos mo ang lahat at binibigyan mo ng buong-buo. Ito ang na-discover ko sa pagganap ko kay Euka. Kumbaga, lahat ibibigay mo at lahat hahamakin mo para sa pagmamahal,” she explained.\n(Gender is not the basis of love. When you love someone, you give your all and you give fully. This is what I discovered from playing Euka. You will give everything and you can face anything in the name of love.)\n“Putahe”, directed by Roman Perez, Jr. and which also stars Hershey de Leon, Massimo Scofield, Nathan Cajucom and Chad Solano, starts streaming May 13 on Vivamax. JB\nRELATED STORIES:\nCatriona Gray wishes Miss Universe PH candidates given ‘more difficult questions’\nLOOK: Pia Wurtzbach radiant in Miss Universe queens-inspired gowns\n \n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "jbalboa"
      },
      {
            "date": "2022-04-30T08:29:00Z",
            "title": "An excellent time to restart that life plan",
            "full_article": "\n\nTessa Prieto-Valdes\n“Not all storms come to disrupt your life, some come to clear your path.” —Paulo Coelho\nI’m a firm believer that hope springs eternal. Springtime means rebirth. It’s the first of May, and it feels like an excellent time to restart that life plan that was put on hold because of the pandemic and all the turmoil it brought. This new journey of a thousand miles has to begin with a meaningful intention to jump-start the voyage. We may be still struggling, but there is light at the end of this dark tunnel.\nCristalle Belo-Pitt, Millet Liberato Simeon at Red Charity Gala 2017\nWe have weathered the storm somehow, all of us out in the rough seas, but not necessarily in the same boat. Some may have gone through the pandemic storm on a cruise liner, taking a leisurely break from the stresses of life, while others were braving the waves in a canoe.\nDespite our different experiences, we are all hoping to get through this pandemic in our best capacity, with the aid of our family support group and our personal faith.\nTaeho Lee, Korea Friends of Hope International country manager; Josefino B. Bonilla, Bahay Aruga board director; Viana Joan B. Mata, Bahay Aruga corporate secretary; Sungjae Kim, LG Electronics Philippines managing director; Kerry and Kaye Tiñga; Young Park, LG Electronics Philippines product director for Air Solutions\nAfter a year of seeking my higher purpose following a drastic life shift, I have turned to the Lord through meditation, bible study and Catholic Mass.\nWhen a catastrophic event happens in your life, whether it is physical, relational, or mental, there is a life-altering change in our mindset. Personally, I have radically refocused my priorities and time to the ones I love. Spending a month on a family vacation here in Australia has further cemented my life purpose and love of God and family.\n\n\n\n\nDorothy and Raffy Toda, Alex Prieto, Mily Toda, Marixi Prieto, Sea Princess\nP500,000 donation grant\nTogether with Kaye Tiñga, my Red Charity Gala (RCG) partner, I am resuming plans of the next RCG event so that we may continue our charitable work. Thanks to our generous friends at LG Electronics Philippines, Kaye and I are able to continue helping the community in Siargao with their P500,000 donation grant.\nOver the past few months, LG has been collecting entries for the first-ever local iteration of the LG Ambassador Challenge. The initiative, which was started with Korea Friends of Hope International (KFHI), is a first in the Philippines and affirms LG’s commitment to help deliver sustainable growth to local communities in the country.\nJordan Prieto Valdes, Ikit Agudo, Gigi Forcadilla, Cheska Yupangco, Dodong Pacañor\nAfter reviewing all the entries, LG selected Ride for Hope by Bahay Aruga and Roof for Siargao by RCG. Big thanks to good friend Millet Liberato Simeon for assisting us with this grant.\nBahay Aruga, which was founded in 2014, is a free halfway house for pediatric cancer patients of Philippine General Hospital (PGH). Most of the children need to be in PGH weekly for long-term treatment in Manila. Hence, the halfway house was born.\nEllen Lacson, Mila Lacson, Pinky Lacson-Villafuerte, Ed Lacson\nAs endorsed by the oncology department of PGH, patients with their parents are fully accommodated at Bahay Aruga for free. Recently, the matriarch of Bahay Aruga who conceptualized the halfway house, Marietta Bonilla, passed away due to COVID-19. To continue the program, the Ride for Hope project aims to procure a new ambulance for the patients. Receiving the grant is Josefino B. Bonilla of the board of directors of Bahay Aruga.\n“The daily battle of patients and carers is endless, but choosing Ride for Hope project, and with the new ambulance that we will be able to use, life will be more convenient and better for the pediatric cancer patients. Thank you, LG and KFHI for this program,” he says.\nMillet Liberato Simeon, Athena Valdes, Bela Albert, Mica Ongsiako at Red Charity Gala 2017\nInspire young people\nSince 2009, RCG has been raising funds for numerous beneficiaries through the celebration of Philippine fashion. Collecting over P30 million in the last 11 years, RCG has distributed to Philippine Red Cross and Assumption HS ’81 Foundation, among others. These funds have been used for relief efforts and community building in provinces across the country. With the onset of the pandemic in 2020, our mission was put on hold.\nMarilu Batchelor, Sofia Elizalde, Junie Peña, Samantha Hiranand, Sharm Hiranand, Techie Hagedorn\nMy daughter, Jordan Prieto Valdes, has been very much present in the RCG events and witnessed everyone’s selfless generosity through the years. She had been living in Siargao for six months when Typhoon “Odette” (international name: Rai) hit the province in December.\nAfter seeing the destruction that was made to her second home and to the lives of her friends, she was emboldened to start her own charity fundraising efforts online. It became apparent that her kindheartedness, generosity and her exposure to RCG, made her equipped to care for those whose lives were in shambles after the typhoon.\nNikola, Sharon, Pinky, Jay, Ellen, Mila and Ed Lacson\nEven after exhausting resources from family and friends from Manila and all over the world, Jordan still wanted to help Siargao. So, the RCG Roof for Siargao project was born. As RCG evolves, we go back to the core of bringing people together: It is about giving hope, sharing our blessings and empowering people to rebuild their lives.\nSince I am here in Australia, Kaye and her daughter Kerry attended the awarding. Kaye shared her gratitude to LG saying, “The opportunity for Jordan Valdes to be chosen as an LG ambassador can inspire young people to take the initiative to help improve other people’s lives. We thank LG for giving us, Red Charity Gala, a unique opportunity to make a difference.”\nMarilu Batchelor, Sofia Elizalde, Techie Hagedorn\nWe continue to celebrate life and all the milestones from baptisms to birthdays to weddings, to even just waking up to another beautiful new day. There is always a joyous occasion to be tremendously grateful for. Just as LG says, “Life’s Good!”\nFollow @seaprincess888 on Instagram.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-04-29T07:32:00Z",
            "title": "The precious gift of sports",
            "full_article": "\n\nSpending our weekends (prepandemic) playing football/soccer for our school\nBlood, sweat and tears. Are those the only things you gain once you enter the realm of sports? That’s a thought that gets people apprehensive once they step foot into it. For me, the biggest gift sports offer to us is something intangible, yet so invaluable.\nFor obvious reasons, sports teach us how to strive to be the best. Whatever path you choose to walk on, someway, we are knowledgeable about how cutthroat the world is. For an idealist, this might not seem so hopeful, but to some extent it is. It means that we have this sense of individuality that we can exploit and expose to the world. I was a football varsity member during high school and whenever our coaches strategized prior to a game, we’d often hear caveats about how the opposing team usually plays. They stress upon what makes the team strong, and how we can attack and use their weakness to our advantage, and after the game, we think of how to become better.\nAlong with that, we had to learn how to balance our academics, and other commitments, as most of my teammates were also leaders. Time management was a skill that I really acquired through sports. I remember someone giving me advice, in which she said, no matter how many commitments you have, we all have 24 hours in a day, it’s up to you how to triage these said commitments. Sometimes, other commitments deserve more attention, such as when we have important tournaments like the Women’s National Collegiate Athletic Association, or if finals season was coming up, studying hard would be a nonnegotiable. Moreover, sports are the ultimate package for those who have an insatiable hunger for self-improvement and self-awareness.\nNo shortcuts\nThree summers ago, I wanted to try boxing for no apparent reason, and I greatly relished it. But, the next day, I couldn’t move and my body felt like it weighed a ton as I dragged myself to wherever I had to go to. It got me thinking that our bodies are sort of like engines, we can’t just click the on button and accelerate. We have to warm it up and constantly use it in order for it not to break down because progress is not a linear graph with no setbacks, it’s more like a staircase.\nFor the most part, the memories that remain vivid in my mind are those of the laughs and fond moments that I cherish up until now. After a long day of requirements, a game at the end of training feels like a breath of fresh air.\nKick Off Philippines (@kickoffphofficial on Instagram) organizes flag football trainings, games and tournaments.\nIn a new sport I play now, which is flag football, the community is so diverse, yet so inclusive. Playing sports with people who are always willing to teach you and learn from others is so reassuring, because everyone plays coach and teammate simultaneously. Many may say that sports can be, by no stretch of the imagination, a stress reliever because it induces more stress, most especially physically. But, the only thing sports falls short of is instant gratification, as you need to work hard in every aspect; there are no shortcuts, therefore I think that’s why happiness due to sports lasts longer, and is in all honesty, more gratifying than ever. Doesn’t that sound familiar? Isn’t that just like life in general? We work hard to be able to get the results we want, yet sometimes, we don’t get the results we’ve been praying for. But, just like in sports, it’s OK to cry about it, but what it shouldn’t do to us, is defeat our fighting spirits that can always bounce back.\n\n\n\n\nWhether you play sports on your weekends, or you dream of going professional, keep doing it. You’re doing yourself a favor by growing in environments that are so enriching when it comes to wisdom and self-exploration. Before joining varsity, I was in a slump and I found no motivation in anything at all, but after a spontaneous decision of trying out for a sport, I discovered all these parts of myself I never would’ve if it weren’t for sports. You begin to feel more confident in your own skin by just being yourself, but always constantly improving.\nLooking back at a folder in my hard drive containing all pictures of me playing sports, whatever they may be, I noticed how varied my expressions were. My eyebrows meeting each other as I focused on the game I was playing, or my smile meeting my ears because I loved every aspect of it—the sport, the sun, the field, the free food, the satisfaction and blessing of being able to drink water after playing, the wins, the losses, my teammates and the person sports molded me into. So that’s the priceless gift of sports, it allows us to learn all sorts. —CONTRIBUTED\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-04-29T07:32:00Z",
            "title": "A Gen Z kid’s thoughts on the elections",
            "full_article": "\n\nFor the past few months, the many candidates vying for the different positions in the government have been trying their very best to sway potential voters in their favor. And for a lot of them, their advertisements and promotional materials have been focused on the youth—the first-time voters in Generation Z from the age of 18 to 24.\nThough a nonvoter due to my birth date being a few months after the guidelines set by the Commission on Elections, I am happy to see that all of the candidates hoping for a seat in office recognize the importance of this generation, and the potential that we have for the future of the country in the many different fields that we like to specialize in. More opportunities from government organizations and companies have popped up in the past decade for young people to express themselves and, for the most part, it has been quite positive, something that should be credited to the current crop of politicians.\nNevertheless, I cannot help but look into what we want in our politicians.\nA politician’s role\nCertainly, a politician’s role in our society is extremely important to the well-being of us all. The amending of laws and current policies that are inefficient and outdated allows for a better functioning government as a whole. Moreover, the passage of new laws that align to our ever-changing world allows for the country and its citizens to not fall behind to the rest of the world, keeping us at par with some of the more technologically advanced and capable nations around the globe.\nDespite this, I at times find it very difficult to understand why we need to wait for the so-called next administration, next Congress, or just the next group of politicians to hold power, before we as a community start the change that we so ever desire. Shouldn’t we all do something right now that impacts our community, instead of toggling through our social media for hours? Can’t we all try to improve ourselves, some way, somehow so that we could be of valuable service to other people in the near future?\nYes, I 100-percent support and agree that voicing out your concerns is important, and is integral to a well-oiled democracy. With so much misinformation and disinformation littering the internet, it is important that information going in is properly filtered.\n\n\n\n\nHowever, at times, it just feels that we as the youngest generation have been very hypocritical with the current state of woke culture threatening the definition of true change for the community, leading to more intimidation and hate being spread online. As a result of the current structure of how social media functions nowadays, it promotes constant bickering and fighting between the people who have totally opposing views, causing online feuds and insults to be thrown at one another.\nThe desire to be correct\nFor instance, our desire to be correct causes a “crab mentality” where where we feel it necessary to stomp over other people. As media companies out there have put the majority of their resources on the campaign trail of the aspiring candidates, it has caused people to be overly loyal to the candidate of their choosing. This totally omits from the picture those who desperately need the news features and front page stories—the less fortunate who have been affected by alcoholism, abuse, natural disasters and mental health issues, to name a few.\nWhat is perplexing is the fact that despite the country seeing a reported increase in depression and anxiety, as well as numerous natural disasters that have displaced many during the COVID-19 pandemic, many media stations still would rather flood their pages to report on the drama that surrounds the political landscape. Yes, politics is important, but with so many Filipinos who are unemployed and limping through the past two years of the health crisis, is it really necessary to report about those never-ending fights? Why not focus more on the farmers, the doctors, the students, the micro, small and medium enterprises, and so many more who have been negatively affected?\nEspecially at the moment with this campaign period, it is confusing to see the news articles on political endorsements and the money involved in the process, when there are other key issues that should be prioritized over this political polarization. Creating division in the campaigning season will only bring about more challenges to the succeeding administration.\nIn addition, with a lot of these politicians getting huge sums of money from us to push their political agenda and enrich the countless different media outlets nationwide, it is not surprising to see how many of those that actually need the money are not receiving it. With the huge sums of money pumped into these political campaigns that create hate and division in society, I wonder why this money can’t be given to those that are affected by the Marawi crisis, or those that are affected by the natural disasters, or given to nonprofit and nongovernment organizations that help those who are suffering from depression, heart diseases, cancer, violence and so much more.\nYes, the government has a significant slice in the blame pie for the problems that this country faces. However, we also deserve a part of the slice as well for some of the issues in the Philippines.\nThe overreliance that we have on one person and one government to somehow be able to change the country in a six-year term in office is bogus and unfair to them. Despite being given the position by the electorate, recognizing that the country will not be able to progress without our on-the-ground action is important as well in becoming a better Philippines. —CONTRIBUTED\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-04-29T05:53:16Z",
            "title": "Pampanga’s Alviera is the ultimate summer destination to explore the great outdoors",
            "full_article": "\n\nIn Porac, Pampanga’s Alviera, unique facilities and activated spaces are opening up this month to offer lovers of the great outdoors a chance to explore the region’s local gems.\nShort for “Explore Porac,” the estate is kicking off with its EXPLORAC campaign that offers visitors unique outdoor experiences for all ages in the 1,800-hectare estate of Alviera, one of the country’s largest integrated mixed-use estate by Ayala Land and Leonio Land.\n\nGet your adrenaline pumping\nOutdoor buffs will love the Sandbox, a 2-hectare, one-of-a-kind adventure park that caters all kinds of fun. Experience the 10-meter Giant Swing designed to launch visitors into a thrilling ride towards the sky, and the core-engaging Aerial Walk where groups can set a fun racing challenge with friends or family, or a personal challenge in endurance for solo visitors.\n\n\n\n\n\n\nMore exciting attractions are available at The Adventure Tower. Along with the Aerial Walk, The Sandbox facility features the country’s first roller coaster zipline, a Free Fall jump, and climbing and rappel walls.\nThe Sandbox also holds the Splash Tub, which offers 11 water-oriented obstacle courses, such as the Ball Traverse, the Over-and-Under, and the Wreckers that could challenge anyone’s balancing skills as they walk on the slippery platforms. Within the facility is a lounge pool with Instagram-worthy inflatables perfect for taking breaks after a tiring race or for simply taking selfies.\n\n \nSeek adventure in nature\nAlviera also has offerings for visitors who want to connect with the natural beauty of Pampanga. The Alviera Bike Trails, open to all, with scenic routes designed for trail and gravel bikes, promises to bring fun and adventure to cyclists of all ages and skill levels. This 5-kilometer trail consists of multi-terrain routes which vary from leisure routes to more intense cycling challenges, perfect for weekend ride-out sessions.\nMotorists also have something to look forward to in Alviera. The estate now houses the KTM Off road Track, a 3-hectare motocross course that hosts off road events and offers training programs complete with a set of obstacle courses and facilities.\nFor adventurers who want to fully immerse themselves in the refreshing Porac environment, Alviera is set to soon open its inaugural camp site: W camp. The W Camp welcomes car campers, along with traditional campers and glampers upon request. The campsite features lush greenery, clear, open skies, and nearby streams for a welcome respite from the hustle and bustle of the city. Mark your calendars for the site’s first family camping activity on April 30.\nRelax and take a breather\nFor those who want to just slow down and unwind for the weekend, Alviera has attractions where one can simply bask in nature. Visitors can savor the sight of greens at the Greenscapes, an area which features a blooms field, vertiver and tree farms, and an ornamental plant nursery. An open lawn, a lounge area, and picnic grounds provide ample space for families and friends to gather and relax.\n\nPlanning for a more formal gathering? The estate is also home to the world-class Alviera Country Club, which has multi-purpose function and meeting rooms for gatherings and special events available for rent. The Club features lush open spaces and stunning mountain views, designed to make any get-together feel like an intimate visit with Mother Nature herself.\nWith its myriad of offerings, EXPLORAC brings you closer to the local landscape’s beauty and wonder the Alviera way—through urban living in nature. Whether to slow down or to amp up the energy, one can experience the joy of reconnecting with the environment through EXPLORAC, all while enlivening the local community of Pampanga.\nADVT\n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "Hotaru Niitsu"
      },
      {
            "date": "2022-04-28T10:05:15Z",
            "title": "Watch the Miss Universe Philippines 2022 coronation night LIVE on YouTube",
            "full_article": "\n\nIt’s that time of the year again where the most beautiful Filipinas battle it out with their style, confidence, and wit to win the coveted Miss Universe Philippines title.\nThe Miss Universe Philippines 2022 coronation night will be held at the SM Mall of Asia Arena and Filipinos all over the world will be able to watch the event LIVE and for FREE on April 30 at 7:00PM (Manila time) on the YouTube channel of ABS-CBN Entertainment. ABS-CBN is the official digital streaming partner of the Miss Universe Philippines.\n\nMiss Universe Philippines 2021 and top 5 Miss Universe finisher Beatrice Luigi Gomez will be crowning her successor at the event.\nMeanwhile, Miss Universe 2015 Pia Wurtzbach, Miss Universe 2016 Iris Mittenaere, and Miss Universe 2017 Demi-Leigh Tebow will serve as the coronation night’s hosts.\nThe 32 delegates will compete in highly anticipated segments including the evening gown, swimwear, and Q&A portion in one of pageant history’s most beautiful nights. Bamboo, Francisco Martin, and Sam Concepcion will also be performing at the event.\n\n\n\n\n“Filipinos love beauty pageants. These events have a special way of bringing people together and empowering communities including the LGBTQ+ community. By streaming the Miss Universe coronation night on platforms like YouTube, we hope to bring this important cultural moment closer to more viewers and pageant enthusiasts wherever they may be watching from,” said Mervin Wenke, Head of Communications and Public Affairs, Google Philippines.\nTune in to the Miss Universe Philippines 2022 coronation night LIVE and for FREE on April 30 at 7:00PM (Manila time) on the YouTube channel of ABS-CBN Entertainment.\nADVT\n \n \n \nRead more Lifestyle stories:\nAnother day, another slay: How Pia Wurtzbach gets it done\nUpcoming residential bloc shows how city living should be\nMister Donut brings back ‘Misis Donut’ for Mother’s Day\n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "vcatibog"
      },
      {
            "date": "2022-04-28T09:18:38Z",
            "title": "I am a Filipino politician, and I love the LGBTs",
            "full_article": "\n\nEditor’s note: The following article is a work of fiction, meant as satire. The story, all names, characters, and incidents portrayed in this article are fictitious. No identification with actual persons (living or deceased), places, buildings, and products is intended or should be inferred. The article does not purport to reflect the opinions or views of Lifestyle Inquirer and Inquirer.net\nOh yes, I support the LGBTs! I love LGBT people and I think they’re wonderful. I think they contribute a lot of amazing things to society and they are very talented. We shouldn’t underestimate them. We have to respect them. Some of them work for me and I’ve seen how hardworking and funny they are. I have LGBT friends and they are great.  \nLGBT people should be free to live the life that they want! They are born that way. What they do with their lives is not my business. They should be allowed to exist in society. As the Pope said, who am I to judge? Everyone should be happy. We should not judge people, especially LGBT people. We should all be equal. Equality is important.  \nYou know, I think I’m LGBT too. I feel the suffering of the community because I don’t like gender stereotyping. I don’t like being boxed into gender roles. Sometimes I even wear clothes that aren’t stereotypically meant for my gender. And I like to style my hair differently. Minsan undercut, sometimes long hair. People get confused about that! They don’t know if they should call me sir or ma’am. They’re also scared because I’ve beaten up people before, haha.\nDo I support LGBT rights? What do you mean? Ah, you mean the SOGIE anti-discrimination law? Ano ba yang SOGIE-SOGIE na yan? Oh eto, yung anak ko, he’s so handsome. Para sa mga LGBTs, libre booking. Joke!\nYou know kasi, I don’t think LGBT people are being discriminated against. There are isolated incidents. But generally, the Philippines is a very accepting country and we don’t need a law. Because that’s special protection! What about religion? We need to protect religion and beliefs.\n\n\n\n\nWhat was that again? You’re asking why am I fighting to protect my religious beliefs which I chose, but not the rights of LGBT people who didn’t choose because they were born that way? Who said they were born that way? I did? No, I think you didn’t hear me correctly. It’s on the record? No, you misunderstood me. LGBT people chose to live their lifestyle and it’s unfair to the majority that we give them special privileges. \nAnd honestly, as a Christian, I believe they are committing a sin. But I’m not saying I’m perfect! I’m just saying that we’re all sinful and we should follow God. God made man and woman, and women are meant for men. That’s why I don’t believe in same-sex marriage. I think it’s wrong and unnatural. \nWhat did you say? Homosexuality exists in 1,500 species of animals? I don’t believe that. I only trust the word of God. These scientific studies are no match for the Bible, because man’s knowledge is foolishness in God’s sight, 1 Corinthians 3:19.\nBut let’s get back to what I was saying earlier because I think that it is the most important part you need to write as the headline: I love and support the LGBTs.\nDidn’t you hear what I said? Why are you asking me what I’ve done for the community before? I think you’re purposely distracting people from my main message, which is that I love the LGBTs and I empathize with their problems. \nPlease stop bringing up the argument that the reason why LGBT people suffer is because of poverty, and that poverty is connected with what my family did, which is steal money from the government. \nYou don’t understand politics and statecraft, hija. You know sometimes we have to compromise to achieve the greater good. All you people do is complain, complain, complain. You don’t recognize all the things that you’ve gotten. You’re so ungrateful. Ano ba ang ambag mo? \nYou have to stop creating discord and disharmony. We are all Filipinos. We have to rise up. During these hard times, every Filipino has to unite. Behind me.\nEmail Evan Tan at writerinmanila (at) gmail (dot) com. \nHeader image by Pammy Orlina.\n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "lcelera"
      },
      {
            "date": "2022-04-28T08:30:55Z",
            "title": "Michelle Dee bags lion’s share of special awards at the Miss Universe PH prelims",
            "full_article": "\n\nMichelle Marquez Dee. Miss Universe Philippines Facebook page\nMANILA, Philippines — The oft-quoted line “know when to peak” among pageant circles seems to apply to Michelle Marquez Dee’s journey to the Miss Universe Philippines crown. She may not have topped any of the online challenges during the virtual stage of the competition, but amassed the lion’s share of special awards during the physical phase of the contest.\nThe pageant conducted contests online among the 50 delegates who passed the screening. While Dee did not win in any of those, she was included in the Top 3 contestants in the “Swimsuit” and “Casting Video” challenges.\nOnly 32 delegates moved on to the physical phase of the competition and were introduced during the press presentation at the Hilton Manila at the Resorts World Manila complex in Pasay City earlier this month. There, Dee received the “Multi-Level Beauty” award from pageant sponsor Frontrow, which marked what would become a rewarding journey for the former Miss World Philippines titleholder.\nKatrina Llegado. Miss Universe Philippines Facebook page\nDuring the preliminary competition staged at the Cove Manila Indoor Beach Club of Okada Manila in Parañaque City on April 27, Dee took home almost a third of the special citations—Miss Kumuniverse, Miss Cream Silk, Face of Essentials by Belo, Miss Jojo Bragais, Miss Savepoint, and Miss Medical City.\nOther former national beauty titleholders also took home multiple awards.\nBohol’s Pauline Amelinckx, 2018 Mutya ng Pilipinas and third runner-up in the inaugural Miss Universe Philippines edition, was proclaimed Frontrow Choice Queen and Miss MG Cars. She earlier topped the “Introduction Video” virtual challenge.\n\n\n\n\nDee’s batchmate in the 2019 Miss World Philippines pageant, Reina Hispanoamericana Filipinas Katrina Llegado of Taguig City, received the Miss Philippine Airlines and Miss CAD titles. She also received the most online votes for the “Best in Arrival Look” award during the press presentation and won the online “Swimsuit” challenge earlier.\nCeleste Cortesi. Miss Universe Philippines Facebook page\nFormer Miss Philippines Earth Celeste Cortesi of Pasay City took home the on-site “Best in Arrival Look” award during the press presentation. At the preliminary competition, she was hailed Miss Avana and Miss Aqua Boracay. For the virtual phase of the competition, she topped the “Casting Video” challenge and was among the Top 3 contestants in the “Headshot” and “Swimsuit” challenges.\nPalawan’s Angelica Lopez, who shared with Llegado the popularity poll for “Best in Arrival Look” for the press presentation, received the Frontrow Luxxe Immunoplus Queen Majestic during the preliminary competition. She was among the Top 3 contestants in the “Fashion and Runway” virtual challenge.\nPauline Cucharo Amelinckx. Miss Universe Philippines Facebook page\nMandaue’s Isabel Luche who topped the virtual “Headshot” challenge was hailed Miss Jewelmer, while Cebu City’s Chantal Elise Schmidt who was among the Top 3 in the “Fashion and Runway” challenge was Miss Cavaso. Lou Dominique Piczon from Cebu Province, who was included in the Top 3 for the “Introduction Video” challenge, was Miss Okada Manila.\nReigning queen Beatrice Luigi Gomez will crown her successor at the culmination of the 2022 Miss Universe Philippines coronation night at the Mall of Asia Arena in Pasay City on April 30.\nFilipino Miss Universe winner Pia Wurtzbach will share hosting chores with her successors Iris Mittenaere of France and Demi-Leigh Tebow of South Africa.\nCurrent Miss Universe Harnaaz Sandhu of India will be one of the judges, while Filipino-American “American Idol” finalist Francisco Martin will perform.\nRELATED STORIES\nMiss Universe PH unveils new crown for 2022 pageant\nMiss Universe PH Tourism Katrina Dimaranan bids goodbye to pageants after 10 years\nLIST: Miss Universe PH reveals top 50 candidates for 2022 pageant\n \n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "dagacer"
      },
      {
            "date": "2022-04-28T08:06:00Z",
            "title": "Terno design tilt turns spotlight on ‘Balintawak’",
            "full_article": "\n\nCirca 1930s Balintawak from the album of Inang Paras. Traditionally the “alampay” matches the “tapis.”\nThe second Ternocon held in January 2020 was one of the last big events held before the world went into lockdown. It had only been a few days since Taal Volcano in Batangas spewed plumes of ash that reached as far as Manila, and news of a deadly virus was already stoking fears.\nThat glittering evening, however, guests in terno and barong Tagalog swanned around the lobby of the Cultural Center of the Philippines (CCP) before being ushered into the main theater for the show where the terno was the star. Before the collections of the contestants were shown, mentors Lesley Mobo, Ivar Aseron and Philip Rodriguez first presented their own creations. The gold medal winner was Hannah Adrias, whose military-inspired collection caught the eye of the judges.\nBalintawak with an image of the Philippine flag on the butterfly sleeves —FROM THE Collection of Gino Gonzales\nFor the third Ternocon set for January 2023, the organizers, namely CCP through its Cultural Exchange Department (CED) and Bench/Suyen Corp, have decided to tone it down to reflect the times. Artistic director Gino Gonzales said it would be held in the afternoon for a more relaxed affair.\nLast week, Gonzales, with designer Mobo, writer and historian Felice Sta. Maria and social historian Isidra Reyes gave online lectures to all the applicants on the topics “The Balintawak: Evolution, Context and Components,” “A Designer’s Creative Process,” “Filipinas who Wear the Terno” and “Wearing One’s Heart on One’s Sleeve.”\nThis year, there were close to 80 applicants compared to the two previous Terncon competitions, with only around 50 applicants both times.\n“We also received a lot of online inquiries, but we are going to be as stringent as we can before we decide on the final 12 contestants,” Gonzales told Lifestyle in a phone interview.\n\n\n\n\nHand-tinted postcards of 1930s Balintawak from the album of Josefina T. Gonzales, a second-generation designer from the house of R.T. Paras. They show the various components of the ensemble and how they can be worn.\nIn the past, the mentors led by veteran designer Into Sotto went through all the applicants’ designs and earlier works to check on their capabilities.\n“For them to even be considered, they should already have certain skill sets in design, cutting and pattern making. They can’t be ordering a seamstress or a cutter to do their work for them,” Gonzales said.\nAlso important is that finalists should be able to work with and take direction from their mentors. Gonzales said that in the past, there had been a few who refused to heed their mentors or were difficult to work with.\n“They should realize how much work and time we all put in for this project, so we expect 100 percent participation from them.”\nHand-tinted postcards of 1930s Balintawak from the album of Josefina T. Gonzales, a second-generation designer from the house of R.T. Paras. They show the various components of the ensemble and how they can be worn.\nFour points\nThis year, finalists will be tasked to create their version of the balintawak, which Gonzales described as “a more comfortable, country version of a terno.” The butterfly sleeves will still be present but unlike the more formal terno, the balintawak is distinguishable by four points.\n“It is worn with an alampay, not a panuelo; paired with a tapis, not a sobrefalda; puts an emphasis on informality with the chosen fabric, print and cut; and is more about the countryside than the city. It will be now up to them how they interpret these guidelines,” he said.\nHand-tinted postcards of 1930s Balintawak from the album of Josefina T. Gonzales, a second-generation designer from the house of R.T. Paras. They show the various components of the ensemble and how they can be worn.\n“Another thing that’s different now is that they’re only required to make one outfit, unlike before when they were expected to make three terno using the P15,000 grant. It’s also the organizers’ way of helping them after two years of pandemic,” he added.\nThis year’s mentors are designers Joey Samson, Dennis Lustico and Chito Vijandre, led by Inno Sotto.\nGonzales has his hands full. Aside from his work as artistic director of Ternocon, he is also in charge of putting together an exhibit on indigenous clothing at the Ayala Museum, and is overseeing the refurbishing of Casa Gorordo, the museum in Cebu City housed in an old bahay na bato.\nHand-tinted postcards of 1930s Balintawak from the album of Josefina T. Gonzales, a second-generation designer from the house of R.T. Paras. They show the various components of the ensemble and how they can be worn.\n“We’re counting on the youth to push the terno forward, but we’re also thrilled to work with senior applicants. It’s heartening to see them working alongside their younger counterparts, to see their humility.”\nThe competition is open to practicing Filipino designers or fashion design students who are at least 20 years old. The 12 finalists are expected to create one balintawak each.\nThe finalists will be known by June 12 and will undergo RT-PCR testing before a week-long, locked-in workshop and mentoring in July and October. The final competition and cultural show are slated for Jan. 28, 2023.\nFor more information, visit the CCP website, FB pages of Ternocon, CCP Cultural Exchange Department and Bench or email [email protected].\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
            "author": "NewsPublish"
      },
      {
            "date": "2022-04-28T07:32:08Z",
            "title": "Olivia Wilde served legal papers live on stage",
            "full_article": "\n\nWhen Olivia Wilde was handed a mysterious envelope on stage midway through her presentation before a packed Las Vegas audience, many assumed it was the set-up for an elaborate joke.\nInstead, she was getting served legal papers from her ex-partner Jason Sudeikis.\n“This is for me, right?” asked Wilde, interrupted while introducing footage from her upcoming thriller “Don’t Worry Darling” during Warner Bros’ presentation at CinemaCon, the annual movie theater industry gathering.\n“Very mysterious. I’m going to open it now,” she said, opening an envelope marked “Personal and Confidential” after it was slid calmly onto the stage by an unknown person.\nGlancing at its contents, she asked “Is this a script? OK, got it. Thank you,” before returning to her description of her upcoming thriller, hardly missing a beat.\n\n\n\n\n\nThe envelope was never referred to again during the presentation, prompting speculation that somebody had tried to slip a new screenplay to the actor-director.\nBut it emerged Wednesday the document held legal papers concerning two children Wilde has with her former partner Sudeikis, star of television comedy “Ted Lasso.”\n“Papers were drawn up to establish jurisdiction relating to the children of Ms. Wilde and Mr. Sudeikis,” a source close to Sudeikis told AFP Wednesday.\n“Mr. Sudeikis had no prior knowledge of the time or place that the envelope would have been delivered as this would solely be up to the process service company involved and he would never condone her being served in such an inappropriate manner.”\nWilde’s representatives did not respond to a request for comment.\n“Don’t Worry Darling,” a twisty, erotic thriller inspired by “The Truman Show” and “Inception,” stars Harry Styles, who is currently dating Wilde.\n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "oestrada"
      },
      {
            "date": "2022-04-28T07:23:15Z",
            "title": "First ‘Avatar 2’ footage shown as Disney, Universal hit CinemaCon",
            "full_article": "\n\nby Andrew MARSZAL\nJames Cameron said his long-delayed sequel to “Avatar,” the highest-earning movie of all time, would “push the limits of what cinema can do,” as Disney and Universal presented first looks at their upcoming movies in Las Vegas Wednesday.\nAttendees at the CinemaCon movie theater industry summit were invited to don 3D glasses and return to Pandora, with first footage of “Avatar: The Way of Water” showing Na’vi characters swimming beneath the planet’s oceans and soaring through its skies.\nThe movie, which will be released in December, is the first of four planned sequels to the $2.8 billion-grossing original from 2009.\n“I can assure you it’s been well worth the wait,” said Disney distribution chief Tony Chambers, confirming the film’s name.\nCameron addressed CinemaCon via video from New Zealand, where finishing touches are being put in place on the film.\n\n\n\n\nHe promised giant technological leaps forward from the original, whose main characters Jake Sully (Sam Worthington) and Neytiri (Zoe Saldana) now have a family.\n“We set out once again to push the limits of what cinema can do,” said Cameron.\nTo reacquaint audiences with Pandora nearly 13 years after the smash hit original, which sparked a 3D wave in Hollywood, the first “Avatar” will be re-released in theaters in September.\n– ‘The next decade’ –\nMovie theater bosses are gathering at Caesars Palace in Las Vegas for their annual meeting, where Hollywood studios bring fresh footage and A-list stars to court the industry.\nMarvel Studios boss Kevin Feige kicked off the morning’s Disney presentation, telling attendees that planning for “the next decade” of the record-grossing superhero films was well underway.\nAttendees also got an extended look at “Doctor Strange in the Multiverse of Madness,” which is out next week.\nFootage showed Benedict Cumberbatch’s sorcerer battling an extra-terrestrial floating octopus, encountering a universe-hopping teenage girl, and attending his ex’s wedding.\nIt will be followed by two more Marvel films this year — sequels to “Thor” and “Black Panther.”\nPixar showed 30 minutes of “Lightyear,” an origin story for the beloved astronaut from “Toy Story,” voiced by Chris Evans.\nThe movie, out in June, finds Buzz racked with guilt after marooning his crew of space rangers on a hostile alien planet.\nIn his bid to save them, he is forced to travel into the future — aided by a cute robotic cat.\nAlso on show was “Amsterdam,” an “original romantic crime epic” starring Christian Bale, Robert De Niro, Margot Robbie and Chris Rock among an A-list ensemble.\nThe 1930s period piece about three friends who “find themselves at the center of one of the most shocking secret plots in American history,” which purports to be based on true events, comes out in November.\n– Universal slate –\nUniversal then took the stage at Caesars Palace to show footage from the upcoming “Jurassic World: Dominion,” out in June.\nThe film will team the franchise’s recent stars Chris Pratt and Bryce Dallas Howard with those from Steven Spielberg’s original almost 30 years ago, including Jeff Goldblum.\nGoldblum joked that his character’s famous line that scientists “didn’t stop to think if they should” bring back the dinosaurs had been “aggressively ignored throughout the course of the next several movies.”\nBilly Eichner presented “Bros,” the “first gay rom com ever made by a major studio,” joking that it “only took a century.”\n“It’s about something that we can all relate to — how hard it is to simply find another tolerable human being to go through life with,” said Eichner.\nAnd Carey Mulligan discussed “She Said,” based on the true story of journalists investigating Hollywood sex assault scandals who prompted the downfall of Harvey Weinstein, out November.\nCinemaCon concludes Thursday.\n\n\nGet the latest lifestyle news delivered to your inbox\n\n\n\nBy providing an email address. I agree to the Terms of Use and\nacknowledge that I have read the Privacy Policy.\n\n\n\n",
            "author": "oestrada"
      }
]